---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.Perimeter
source: html/8bd879d0-f11e-48ed-8263-c9fe06cba985.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.Perimeter Property

Painting surface of the unit length.

## Syntax (C#)
```csharp
public double Perimeter { get; set; }
```